bench_db/confusion/test/4_10000
sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 4, tps: 1927.11, reads/s: 0.00, writes/s: 1927.41, response time: 11.58ms (95%)
[  20s] threads: 4, tps: 1863.73, reads/s: 0.00, writes/s: 1863.73, response time: 11.61ms (95%)
[  30s] threads: 4, tps: 1878.36, reads/s: 0.00, writes/s: 1878.36, response time: 11.39ms (95%)
[  40s] threads: 4, tps: 1841.86, reads/s: 0.00, writes/s: 1841.86, response time: 11.79ms (95%)
[  50s] threads: 4, tps: 1823.94, reads/s: 0.00, writes/s: 1823.94, response time: 11.80ms (95%)
[  60s] threads: 4, tps: 1899.07, reads/s: 0.00, writes/s: 1899.07, response time: 11.19ms (95%)
[  70s] threads: 4, tps: 1925.18, reads/s: 0.00, writes/s: 1925.18, response time: 11.17ms (95%)
[  80s] threads: 4, tps: 1898.12, reads/s: 0.00, writes/s: 1898.12, response time: 11.26ms (95%)
[  90s] threads: 4, tps: 1890.06, reads/s: 0.00, writes/s: 1890.06, response time: 11.35ms (95%)
[ 100s] threads: 4, tps: 1921.23, reads/s: 0.00, writes/s: 1921.23, response time: 11.28ms (95%)
[ 110s] threads: 4, tps: 1918.62, reads/s: 0.00, writes/s: 1918.62, response time: 11.35ms (95%)
[ 120s] threads: 4, tps: 1847.40, reads/s: 0.00, writes/s: 1847.40, response time: 11.82ms (95%)
[ 130s] threads: 4, tps: 1868.34, reads/s: 0.00, writes/s: 1868.34, response time: 11.41ms (95%)
[ 140s] threads: 4, tps: 1861.67, reads/s: 0.00, writes/s: 1861.67, response time: 11.58ms (95%)
[ 150s] threads: 4, tps: 1862.12, reads/s: 0.00, writes/s: 1862.12, response time: 11.51ms (95%)
[ 160s] threads: 4, tps: 1826.80, reads/s: 0.00, writes/s: 1826.90, response time: 11.87ms (95%)
[ 170s] threads: 4, tps: 1864.69, reads/s: 0.00, writes/s: 1864.59, response time: 11.59ms (95%)
[ 180s] threads: 4, tps: 1945.44, reads/s: 0.00, writes/s: 1945.14, response time: 11.07ms (95%)
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           338643
        other:                           677286
        total:                           1015929
    transactions:                        338643 (1881.28 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 338643 (1881.28 per sec.)
    other operations:                    677286 (3762.56 per sec.)

General statistics:
    total time:                          180.0066s
    total number of events:              338643
    total time taken by event execution: 718.1358s
    response time:
         min:                                  0.28ms
         avg:                                  2.12ms
         max:                                287.10ms
         approx.  95 percentile:              11.48ms

Threads fairness:
    events (avg/stddev):           84660.7500/178.05
    execution time (avg/stddev):   179.5339/0.01

sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 4, tps: 1797.03, reads/s: 0.00, writes/s: 1797.33, response time: 11.67ms (95%)
[  20s] threads: 4, tps: 1876.18, reads/s: 0.00, writes/s: 1875.98, response time: 11.46ms (95%)
[  30s] threads: 4, tps: 1850.93, reads/s: 0.00, writes/s: 1851.13, response time: 11.35ms (95%)
[  40s] threads: 4, tps: 1875.64, reads/s: 0.00, writes/s: 1875.64, response time: 11.13ms (95%)
[  50s] threads: 4, tps: 1817.39, reads/s: 0.00, writes/s: 1817.39, response time: 11.40ms (95%)
[  60s] threads: 4, tps: 1811.52, reads/s: 0.00, writes/s: 1811.52, response time: 11.73ms (95%)
[  70s] threads: 4, tps: 1849.36, reads/s: 0.00, writes/s: 1849.36, response time: 11.34ms (95%)
[  80s] threads: 4, tps: 1857.42, reads/s: 0.00, writes/s: 1857.42, response time: 11.48ms (95%)
[  90s] threads: 4, tps: 1794.86, reads/s: 0.00, writes/s: 1794.86, response time: 11.63ms (95%)
[ 100s] threads: 4, tps: 1794.93, reads/s: 0.00, writes/s: 1794.93, response time: 11.66ms (95%)
[ 110s] threads: 4, tps: 1840.77, reads/s: 0.00, writes/s: 1840.77, response time: 11.44ms (95%)
[ 120s] threads: 4, tps: 1847.10, reads/s: 0.00, writes/s: 1847.10, response time: 11.18ms (95%)
[ 130s] threads: 4, tps: 1859.25, reads/s: 0.00, writes/s: 1859.25, response time: 11.39ms (95%)
[ 140s] threads: 4, tps: 1830.01, reads/s: 0.00, writes/s: 1830.01, response time: 11.37ms (95%)
[ 150s] threads: 4, tps: 1821.34, reads/s: 0.00, writes/s: 1821.44, response time: 11.56ms (95%)
[ 160s] threads: 4, tps: 1819.94, reads/s: 0.00, writes/s: 1819.84, response time: 11.48ms (95%)
[ 170s] threads: 4, tps: 1866.64, reads/s: 0.00, writes/s: 1866.64, response time: 11.19ms (95%)
[ 180s] threads: 4, tps: 1834.46, reads/s: 0.00, writes/s: 1834.16, response time: 11.45ms (95%)
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           330445
        other:                           660890
        total:                           991335
    transactions:                        330445 (1835.75 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 330445 (1835.75 per sec.)
    other operations:                    660890 (3671.51 per sec.)

General statistics:
    total time:                          180.0051s
    total number of events:              330445
    total time taken by event execution: 718.1605s
    response time:
         min:                                  0.28ms
         avg:                                  2.17ms
         max:                                214.48ms
         approx.  95 percentile:              11.44ms

Threads fairness:
    events (avg/stddev):           82611.2500/840.50
    execution time (avg/stddev):   179.5401/0.02

sysbench 0.5:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Random number generator seed is 0 and will be ignored


Threads started!

[  10s] threads: 4, tps: 1798.64, reads/s: 0.00, writes/s: 1798.94, response time: 11.85ms (95%)
[  20s] threads: 4, tps: 1819.57, reads/s: 0.00, writes/s: 1819.47, response time: 11.78ms (95%)
[  30s] threads: 4, tps: 1852.65, reads/s: 0.00, writes/s: 1852.75, response time: 11.25ms (95%)
[  40s] threads: 4, tps: 1779.35, reads/s: 0.00, writes/s: 1779.35, response time: 11.59ms (95%)
[  50s] threads: 4, tps: 1810.11, reads/s: 0.00, writes/s: 1810.11, response time: 11.50ms (95%)
[  60s] threads: 4, tps: 1823.83, reads/s: 0.00, writes/s: 1823.83, response time: 11.45ms (95%)
[  70s] threads: 4, tps: 1793.49, reads/s: 0.00, writes/s: 1793.39, response time: 11.57ms (95%)
[  80s] threads: 4, tps: 1830.29, reads/s: 0.00, writes/s: 1830.39, response time: 11.29ms (95%)
[  90s] threads: 4, tps: 1802.32, reads/s: 0.00, writes/s: 1802.32, response time: 11.42ms (95%)
[ 100s] threads: 4, tps: 1783.51, reads/s: 0.00, writes/s: 1783.51, response time: 11.50ms (95%)
[ 110s] threads: 4, tps: 1876.66, reads/s: 0.00, writes/s: 1876.66, response time: 11.07ms (95%)
[ 120s] threads: 4, tps: 1849.99, reads/s: 0.00, writes/s: 1849.99, response time: 11.05ms (95%)
[ 130s] threads: 4, tps: 1891.32, reads/s: 0.00, writes/s: 1891.12, response time: 11.18ms (95%)
[ 140s] threads: 4, tps: 1852.60, reads/s: 0.00, writes/s: 1852.80, response time: 11.21ms (95%)
[ 150s] threads: 4, tps: 1849.38, reads/s: 0.00, writes/s: 1849.38, response time: 11.31ms (95%)
[ 160s] threads: 4, tps: 1888.09, reads/s: 0.00, writes/s: 1888.09, response time: 11.12ms (95%)
[ 170s] threads: 4, tps: 1812.57, reads/s: 0.00, writes/s: 1812.47, response time: 11.39ms (95%)
[ 180s] threads: 4, tps: 1878.21, reads/s: 0.00, writes/s: 1878.01, response time: 11.29ms (95%)
OLTP test statistics:
    queries performed:
        read:                            0
        write:                           329891
        other:                           659782
        total:                           989673
    transactions:                        329891 (1832.66 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 329891 (1832.66 per sec.)
    other operations:                    659782 (3665.31 per sec.)

General statistics:
    total time:                          180.0071s
    total number of events:              329891
    total time taken by event execution: 718.1093s
    response time:
         min:                                  0.26ms
         avg:                                  2.18ms
         max:                                292.01ms
         approx.  95 percentile:              11.39ms

Threads fairness:
    events (avg/stddev):           82472.7500/592.53
    execution time (avg/stddev):   179.5273/0.02